Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_subnet.iac-subnet-20220223 has changed
~ resource "aws_subnet" "iac-subnet-20220223" {
      ~ enable_resource_name_dns_aaaa_record_on_launch = true -> false
        id                                             = "subnet-0f934a92067b0f67e"
        tags                                           = {
            "Name" = "iac-subnet-20220223"
        }
        # (14 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place
- destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_route53_record.iac-route53-20220223 must be replaced
-/+ resource "aws_route53_record" "iac-route53-20220223" {
      + allow_overwrite = (known after apply)
      ~ fqdn            = "iac.rhea-so.com" -> (known after apply)
      ~ id              = "Z0991838PJM65M902BCW_iac.rhea-so.com_A" -> (known after apply)
      ~ name            = "iac.rhea-so.com" -> "rhea-so.com" # forces replacement
      ~ zone_id         = "Z0991838PJM65M902BCW" -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # aws_route53_zone.primary will be destroyed
  # (because aws_route53_zone.primary is not in configuration)
- resource "aws_route53_zone" "primary" {
      - arn           = "arn:aws:route53:::hostedzone/Z0991838PJM65M902BCW" -> null
      - comment       = "Managed by Terraform" -> null
      - force_destroy = false -> null
      - id            = "Z0991838PJM65M902BCW" -> null
      - name          = "rhea-so.com" -> null
      - name_servers  = [
          - "ns-1509.awsdns-60.org",
          - "ns-1684.awsdns-18.co.uk",
          - "ns-492.awsdns-61.com",
          - "ns-746.awsdns-29.net",
        ] -> null
      - tags          = {} -> null
      - tags_all      = {} -> null
      - zone_id       = "Z0991838PJM65M902BCW" -> null
    }

  # aws_route53_zone.rhea-so will be created
+ resource "aws_route53_zone" "rhea-so" {
      + arn           = (known after apply)
      + comment       = "Managed by Terraform"
      + force_destroy = false
      + id            = (known after apply)
      + name          = "rhea-so.com"
      + name_servers  = (known after apply)
      + tags_all      = (known after apply)
      + zone_id       = (known after apply)
    }

  # aws_subnet.iac-subnet-20220223 will be updated in-place
~ resource "aws_subnet" "iac-subnet-20220223" {
      ~ enable_resource_name_dns_a_record_on_launch    = true -> false
        id                                             = "subnet-0f934a92067b0f67e"
        tags                                           = {
            "Name" = "iac-subnet-20220223"
        }
        # (14 unchanged attributes hidden)
    }

Plan: 2 to add, 1 to change, 2 to destroy.


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d .`
* :put_litter_in_its_place: To **delete** this plan click [here](http://52.78.144.248/lock?id=rhea-so-lab%252FInfrastructure-as-Code%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d .`
</details>

**Note: Objects have changed outside of Terraform**
Plan: 2 to add, 1 to change, 2 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
